# Hands on!

In [87]:
import numpy as np
import pandas as pd

# Pandas utility functions

In [88]:
pd.isnull(np.nan)

True

In [89]:
pd.isnull(None)

True

In [90]:
pd.isna(np.nan)

True

In [91]:
pd.isna(None)

True

In [92]:
pd.notnull(None)

False

In [93]:
pd.notnull(np.nan)

False

In [94]:
pd.notna(np.nan)

False

In [95]:
pd.notnull(3)

True

In [96]:
pd.isnull(pd.Series([1, np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [97]:
pd.notnull(pd.Series([1, np.nan, 7]))

0     True
1    False
2     True
dtype: bool

In [98]:
pd.isnull(pd.DataFrame({    
    'Column A' : [1, np.nan, 7],
    'Column B' : [np.nan, 2, 3],
    'Column C' : [np.nan, 2, np.nan]
}))

   Column A  Column B  Column C
0     False      True      True
1      True     False     False
2     False     False      True

# Pandas Operations with Missing Values

In [99]:
pd.Series([1, 2, np.nan]).count()

2

In [100]:
pd.Series([1, 2, np.nan]).sum()

3.0

In [101]:
pd.Series([1, 2, np.nan]).mean()

1.5

# Filtering missing data

In [102]:
s = pd.Series([1, 2, 3, np.nan, np.nan, 4])

In [103]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [104]:
pd.isnull(s).sum()

2

In [105]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [106]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [107]:
s.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [108]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

# Dropping Null Values

In [109]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [110]:
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [111]:
df = pd.DataFrame({
    'Column A' : [1, np.nan, 30, np.nan],
    'Column B' : [2, 8, 31, np.nan],
    'Column C' : [np.nan, 9, 32, 100],
    'Column D' : [5, 8, 34, 110],
})

In [112]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [113]:
df.shape

(4, 4)

In [114]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  2 non-null      float64
 1   Column B  3 non-null      float64
 2   Column C  3 non-null      float64
 3   Column D  4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [115]:

df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [116]:
df.isnull().sum()

Column A    2
Column B    1
Column C    1
Column D    0
dtype: int64

In [117]:
df.dropna()

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [118]:
df.dropna(axis=1)

   Column D
0         5
1         8
2        34
3       110

In [119]:
df2 = pd.DataFrame({
    'Column A': [1, np.nan, 30],
    'Column B': [2, np.nan, 31],
    'Column C': [np.nan, np.nan, 100]
})

In [120]:
df2

   Column A  Column B  Column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [121]:
df2.dropna(how='all')

   Column A  Column B  Column C
0       1.0       2.0       NaN
2      30.0      31.0     100.0

In [122]:
df2.dropna(how='any')

   Column A  Column B  Column C
2      30.0      31.0     100.0

In [123]:
df.dropna(thresh=3)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34

In [124]:
df.dropna(thresh=3, axis='columns')

   Column B  Column C  Column D
0       2.0       NaN         5
1       8.0       9.0         8
2      31.0      32.0        34
3       NaN     100.0       110

# Filling null values

In [125]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [126]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [127]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [128]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [129]:
s.fillna(method='ffill')

/tmp/ipykernel_2705/1029756637.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method='ffill')

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [130]:
s.fillna(method='bfill')

/tmp/ipykernel_2705/1641295691.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

In [131]:
pd.Series([np.nan, 3, np.nan, 9]).fillna(method='ffill')

/tmp/ipykernel_2705/533636215.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  pd.Series([np.nan, 3, np.nan, 9]).fillna(method='ffill')

0    NaN
1    3.0
2    3.0
3    9.0
dtype: float64

In [132]:
pd.Series([1, np.nan, 3, np.nan, np.nan]).fillna(method='bfill')

/tmp/ipykernel_2705/2629518188.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  pd.Series([1, np.nan, 3, np.nan, np.nan]).fillna(method='bfill')

0    1.0
1    3.0
2    3.0
3    NaN
4    NaN
dtype: float64

# Filling null values on DataFrames

In [133]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [134]:
df.fillna({
    'Column A' : 0,
    'Column B': 99,
    'Column C': df['Column C'].mean()
})

   Column A  Column B  Column C  Column D
0       1.0       2.0      47.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0      99.0     100.0       110

In [135]:
df.fillna(method='ffill', axis=0)

/tmp/ipykernel_2705/3122255136.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', axis=0)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       1.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      30.0      31.0     100.0       110

In [136]:
df.fillna(method='ffill', axis=1)

/tmp/ipykernel_2705/901808322.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', axis=1)

   Column A  Column B  Column C  Column D
0       1.0       2.0       2.0       5.0
1       NaN       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3       NaN       NaN     100.0     110.0

# Checking if there are NAs

In [137]:
s.dropna().count()

4

In [138]:
missing_values = len(s.dropna()) != len(s)
missing_values

True

In [139]:
len(s)

6

In [140]:
s.count()

4

In [141]:
missing_values = s.count() != len(s)
missing_values

True

In [142]:
pd.Series([True, False, False]).any()

True

In [143]:
pd.Series([True, False, False]).all()

False

In [144]:
pd.Series([True, True, True]).all()

True

In [145]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [146]:
pd.Series([1, np.nan]).isnull().any()

True

In [147]:
pd.Series([1, 2]).isnull().any()

False

In [148]:
s.isnull().any()

True

In [149]:
s.isnull().values

array([False, False, False,  True,  True, False])

In [152]:
s.isnull().values.any()

True